#include <iostream>
#include <unistd.h>
using namespace std;
 
int main()
{
// ---------------------------- Тёмные цвета и background-ы------------->
    system("clear");
    cout << "\033[20;50H" << "Код 30 "<<  "\033[00m";  //чёрный
    //cout << "\033[31m" << "Код 31 "<<  "\033[00m";  //тёмно красный
    //cout << "\033[32m" << "Код 32 "<<  "\033[00m";  //зеленый
    //cout << "\033[33m" << "Код 33 "<<  "\033[00m";  //тёмно-желтый
    //cout << "\033[34m" << "Код 34 "<<  "\033[00m";  //синий
    //cout << "\033[35m" << "Код 35 "<<  "\033[00m";  //фиолетовый
    //cout << "\033[36m" << "Код 36\n"<< "\033[00m";  //тёмно-бирюзовый
 
    //cout << "\033[41m" << "Код 41 "<<  "\033[00m";  //тёмно красный background
    //cout << "\033[42m" << "Код 42 "<<  "\033[00m";  //тёмно зелёный background
    //cout << "\033[43m" << "Код 43 "<<  "\033[00m";  //тёмно жёлтый background
    //cout << "\033[44m" << "Код 44 "<<  "\033[00m";  //тёмно голубой background
    //cout << "\033[45m" << "Код 45 "<<  "\033[00m";  //тёмно розовый background
   // cout << "\033[46m" << "Код 46 "<<  "\033[00m";  //тёмно берюзовый background
    //cout << "\033[47m" << "Код 47\n"<< "\033[00m";  //тёмно белый background
 
// ---------------------------- Яркие цвета и background-ы------------->
 
    //cout << "\033[90m" << "Код 90 "<<  "\033[00m";  //тёмно-серый
    //cout << "\033[91m" << "Код 91 "<<  "\033[00m";  //красный
    //cout << "\033[m" << "Код 100 "<<  "\033[00m";  //серый background
    //cout << "\033[101m" << "Код 101 "<<  "\033[00m";  //ярко красный background
    //cout << "\033[102m" << "Код 102 "<<  "\033[00m";  //ярко зелёный background
    //cout << "\033[103m" << "Код 103 "<<  "\033[00m";  //ярко желтый background
    //cout << "\033[104m" << "Код 104 "<<  "\033[00m";  //ярко фиолетовый background
    //cout << "\033[105m" << "Код 105 "<<  "\033[00m";  //ярко розовый background
    //cout << "\033[106m" << "Код 106 "<<  "\033[00m";  //ярко берюзовый background
    //cout << "\033[107m" << "Код 107\n"<< "\033[00m";  //ярко белый background
 
// ----------------------------Системные комманды---------------------->
 
    //cout << "\033[05m" << "Код 05 "<<  "\033[00m";  //мерцание
    //cout << "\033[04m" << "Код 04 "<<  "\033[00m";  //подчёркивание
    //cout << "\033[01m" << "Код 01 "<<  "\033[00m";  //жирный
   // cout << "\033[00m" << "Код 00\n"<< "\033[00m";  //default
 
    //   "\033[2J" -clear
    //   "\033[07m" - предыдущий background как цвет текста
 
//--------------------------------Управление положением курсора--------->
 
    //    \033[#A передвинуть курсор вверх на # строк
    //    \033[#B передвинуть курсор вниз на # строк
    //    \033[#С передвинуть курсор вправо на # столбцов
    //    \033[#D передвинуть курсор влево на # столбцов
    //    \033[#E передвинуть курсор вниз на # строк и поставить в начало строки
    //    \033[#F передвинуть курсор вверх на # строк и поставить в начало строки
    //    \033[#G переместить курсор в указанный столбец текущей строки
    //    \033[#;#H задает абсолютные координаты курсора (строка, столбец)
    //sleep(1000);
    //    \033]2;BLA_BLA\007   Заголовок окна xterm...
}